sim/task_2D_Cylinder_Template_coarse/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
6320
(
1.04464e-09
1.04572e-09
1.04681e-09
1.0479e-09
1.04899e-09
1.05008e-09
1.05117e-09
1.05225e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
1.04413e-09
1.04419e-09
1.04425e-09
1.04431e-09
1.04437e-09
1.04442e-09
1.04446e-09
1.04448e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
66
(
1.10143e-09
1.09347e-09
1.09345e-09
1.09513e-09
1.09165e-09
1.08917e-09
1.08513e-09
1.08129e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
136
(
0.000572574
0.000551964
0.00052975
0.000505984
0.000480692
0.000453901
0.000425634
0.000395911
...
)
;
    }
}


// ************************************************************************* //
