sim/task_2D_Cylinder_Template_coarse/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1500";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
12436
(
4.6872
0.00497115
-0.00466765
4.68636
0.0149001
-0.0140659
4.68505
0.0254443
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
66
(
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
140
(
-0.000111669
0.000417023
0.00110837
0.00194118
0.00291342
0.00396619
0.00506377
0.00617734
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
66
(
4.79921
4.78806
4.78233
4.77183
4.76449
4.75571
4.74881
4.74164
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
